app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "qweqweqwe"], ["status", 0], ["created_at", "2020-06-13 19:42:45.007750"], ["updated_at", "2020-06-13 19:42:45.007750"]]
---
  def create
    @todo = Todo.create!(todo_params)

UPDATE "todos" SET "description" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["description", "Find the defintion"], ["updated_at", "2020-06-13 23:12:53.130571"], ["id", 6]]
---
  def update
    @todo.update(todo_params)